lkolbly/cmsis-svd/data/TexasInstruments/LM3S5C56.svd
        <register>
          <name>ACTIVE0</name>
          <description>Interrupt 0-31 Active Bit</description>
          <addressOffset>0x00000300</addressOffset>
          <fields>
            <field>
              <name>NVIC_ACTIVE0_INT</name>
              <description>Interrupt Active</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT0</name>
                  <description>Interrupt 0 active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT1</name>
                  <description>Interrupt 1 active</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT2</name>
                  <description>Interrupt 2 active</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT3</name>
                  <description>Interrupt 3 active</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT4</name>
                  <description>Interrupt 4 active</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT5</name>
                  <description>Interrupt 5 active</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT6</name>
                  <description>Interrupt 6 active</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT7</name>
                  <description>Interrupt 7 active</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT8</name>
                  <description>Interrupt 8 active</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT9</name>
                  <description>Interrupt 9 active</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT10</name>
                  <description>Interrupt 10 active</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT11</name>
                  <description>Interrupt 11 active</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT12</name>
                  <description>Interrupt 12 active</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT13</name>
                  <description>Interrupt 13 active</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT14</name>
                  <description>Interrupt 14 active</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT15</name>
                  <description>Interrupt 15 active</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT16</name>
                  <description>Interrupt 16 active</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT17</name>
                  <description>Interrupt 17 active</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT18</name>
                  <description>Interrupt 18 active</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT19</name>
                  <description>Interrupt 19 active</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT20</name>
                  <description>Interrupt 20 active</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT21</name>
                  <description>Interrupt 21 active</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT22</name>
                  <description>Interrupt 22 active</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT23</name>
                  <description>Interrupt 23 active</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT24</name>
                  <description>Interrupt 24 active</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT25</name>
                  <description>Interrupt 25 active</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT26</name>
                  <description>Interrupt 26 active</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT27</name>
                  <description>Interrupt 27 active</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT28</name>
                  <description>Interrupt 28 active</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT29</name>
                  <description>Interrupt 29 active</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT30</name>
                  <description>Interrupt 30 active</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT31</name>
                  <description>Interrupt 31 active</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE1</name>
          <description>Interrupt 32-54 Active Bit</description>
          <addressOffset>0x00000304</addressOffset>
          <fields>
            <field>
              <name>NVIC_ACTIVE1_INT</name>
              <description>Interrupt Active</description>
              <bitRange>[22:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT32</name>
                  <description>Interrupt 32 active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT33</name>
                  <description>Interrupt 33 active</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT34</name>
                  <description>Interrupt 34 active</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT35</name>
                  <description>Interrupt 35 active</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT36</name>
                  <description>Interrupt 36 active</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT37</name>
                  <description>Interrupt 37 active</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT38</name>
                  <description>Interrupt 38 active</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT39</name>
                  <description>Interrupt 39 active</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT40</name>
                  <description>Interrupt 40 active</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT41</name>
                  <description>Interrupt 41 active</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT42</name>
                  <description>Interrupt 42 active</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT43</name>
                  <description>Interrupt 43 active</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT44</name>
                  <description>Interrupt 44 active</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT45</name>
                  <description>Interrupt 45 active</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT46</name>
                  <description>Interrupt 46 active</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT47</name>
                  <description>Interrupt 47 active</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT48</name>
                  <description>Interrupt 48 active</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT49</name>
                  <description>Interrupt 49 active</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT50</name>
                  <description>Interrupt 50 active</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT51</name>
                  <description>Interrupt 51 active</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT52</name>
                  <description>Interrupt 52 active</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT53</name>
                  <description>Interrupt 53 active</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE1_INT54</name>
                  <description>Interrupt 54 active</description>
                  <value>0x400000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI0</name>
          <description>Interrupt 0-3 Priority</description>
          <addressOffset>0x00000400</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI0_INT0</name>
              <description>Interrupt 0 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI0_INT1</name>
              <description>Interrupt 1 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI0_INT2</name>
              <description>Interrupt 2 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI0_INT3</name>
              <description>Interrupt 3 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI1</name>
          <description>Interrupt 4-7 Priority</description>
          <addressOffset>0x00000404</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI1_INT4</name>
              <description>Interrupt 4 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI1_INT5</name>
              <description>Interrupt 5 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI1_INT6</name>
              <description>Interrupt 6 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI1_INT7</name>
              <description>Interrupt 7 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI2</name>
          <description>Interrupt 8-11 Priority</description>
          <addressOffset>0x00000408</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI2_INT8</name>
              <description>Interrupt 8 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI2_INT9</name>
              <description>Interrupt 9 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI2_INT10</name>
              <description>Interrupt 10 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI2_INT11</name>
              <description>Interrupt 11 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI3</name>
          <description>Interrupt 12-15 Priority</description>
          <addressOffset>0x0000040C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI3_INT12</name>
              <description>Interrupt 12 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI3_INT13</name>
              <description>Interrupt 13 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI3_INT14</name>
              <description>Interrupt 14 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI3_INT15</name>
              <description>Interrupt 15 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI4</name>
          <description>Interrupt 16-19 Priority</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI4_INT16</name>
              <description>Interrupt 16 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI4_INT17</name>
              <description>Interrupt 17 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI4_INT18</name>
              <description>Interrupt 18 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI4_INT19</name>
              <description>Interrupt 19 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI5</name>
          <description>Interrupt 20-23 Priority</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI5_INT20</name>
              <description>Interrupt 20 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI5_INT21</name>
              <description>Interrupt 21 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI5_INT22</name>
              <description>Interrupt 22 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI5_INT23</name>
              <description>Interrupt 23 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI6</name>
          <description>Interrupt 24-27 Priority</description>
          <addressOffset>0x00000418</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI6_INT24</name>
              <description>Interrupt 24 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI6_INT25</name>
              <description>Interrupt 25 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI6_INT26</name>
              <description>Interrupt 26 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI6_INT27</name>
              <description>Interrupt 27 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI7</name>
          <description>Interrupt 28-31 Priority</description>
          <addressOffset>0x0000041C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI7_INT28</name>
              <description>Interrupt 28 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI7_INT29</name>
              <description>Interrupt 29 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI7_INT30</name>
              <description>Interrupt 30 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI7_INT31</name>
              <description>Interrupt 31 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI8</name>
          <description>Interrupt 32-35 Priority</description>
          <addressOffset>0x00000420</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI8_INT32</name>
              <description>Interrupt 32 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI8_INT33</name>
              <description>Interrupt 33 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI8_INT34</name>
              <description>Interrupt 34 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI8_INT35</name>
              <description>Interrupt 35 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI9</name>
          <description>Interrupt 36-39 Priority</description>
          <addressOffset>0x00000424</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI9_INT36</name>
              <description>Interrupt 36 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI9_INT37</name>
              <description>Interrupt 37 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI9_INT38</name>
              <description>Interrupt 38 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI9_INT39</name>
              <description>Interrupt 39 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
